In [1]:
import pandas as pd

In [ ]:
'''
#Da um erro referente a configuracoes de INSTALLED_APPS, tentei criar o arquivo apps.py porem ainda assim retorna erro... precisa estudar melhor django para aplicar o ORM nao eh tao simples como pandas

from django.db import models
from django.apps import apps
import apps as app

apps.get_app_config('admin').verbose_name

class Student(models.Model):
    name = models.CharField(max_length=50)
    grade = models.IntegerField()

class Club(models.Model):
    name = models.CharField(max_length=50)
    members = models.ManyToManyField(Student)
'''

In [56]:
#Aqui atraves do parametro index_col estipula-se a coluna que sera o indice do dataframe
amzn  = pd.read_csv('data/amzn_june_2020.csv', sep=';', index_col=0)
msft  = pd.read_csv('data/msft_june_2020.csv', sep=';', index_col=0)
googl = pd.read_csv('data/google_june_2020.csv', sep=';', index_col=0)

#Test sem index
amzn_noidx  = pd.read_csv('data/amzn_june_2020.csv', sep=';')

In [58]:
amzn.dtypes

Date       object
 Close     object
Volume      int64
Symbol     object
dtype: object

In [3]:
'''
Utilizei essa funcao pois a coluna vinha como Unnamed antes de colocar o parametro index_col 
e indica-lá como a o index do DataFrame, resultado é que a coluna não aparece mais no dataFrame
executar abaixo o comando para o amzn_noidx para ver a diferença
'''
amzn_noidx.rename(columns={"Unnamed: 0" : "Index", 'Date' : 'Data_Full'}, inplace=True)
amzn_noidx.head()

   Index   Data_Full                   Close    Volume Symbol
0      0  01/06/2020      24.710.400.390.625   2928900   AMZN
1      1  02/06/2020   2.472.409.912.109.370   2529900   AMZN
2      2  03/06/2020     247.839.990.234.375   2671000   AMZN
3      3  04/06/2020     246.060.009.765.625   2948700   AMZN
4      4  05/06/2020                  2483.0   3306400   AMZN

In [4]:
amzn.nlargest(10, columns='Volume').tail(3)

          Date                   Close    Volume Symbol
16  23/06/2020   2.764.409.912.109.370   4231700   AMZN
20  29/06/2020      26.803.798.828.125   4223400   AMZN
5   08/06/2020     252.406.005.859.375   3970700   AMZN

In [51]:
googl.nlargest(7, columns='Volume')

          Date                    Close    Volume Symbol
19  26/06/2020       13.625.400.390.625   4882000  GOOGL
14  19/06/2020   14.246.400.146.484.300   2639200  GOOGL
8   11/06/2020   14.019.000.244.140.600   2357200  GOOGL
20  29/06/2020   13.971.700.439.453.100   2253700  GOOGL
4   05/06/2020      144.002.001.953.125   2132100  GOOGL
21  30/06/2020    1.418.050.048.828.120   2014300  GOOGL
16  23/06/2020      146.397.998.046.875   1887600  GOOGL

In [59]:
amzn.loc[len(amzn.index)] = ['02/04/2023', '3500.0', 1258100, 'AMZN']

In [60]:
amzn

          Date                   Close    Volume Symbol
0   01/06/2020      24.710.400.390.625   2928900   AMZN
1   02/06/2020   2.472.409.912.109.370   2529900   AMZN
2   03/06/2020     247.839.990.234.375   2671000   AMZN
3   04/06/2020     246.060.009.765.625   2948700   AMZN
4   05/06/2020                  2483.0   3306400   AMZN
5   08/06/2020     252.406.005.859.375   3970700   AMZN
6   09/06/2020   2.600.860.107.421.870   5176000   AMZN
7   10/06/2020   2.647.449.951.171.870   4946000   AMZN
8   11/06/2020      25.579.599.609.375   5800100   AMZN
9   12/06/2020     254.502.001.953.125   5429600   AMZN
10  15/06/2020   2.572.679.931.640.620   3865100   AMZN
11  16/06/2020     261.527.001.953.125   3585600   AMZN
12  17/06/2020     264.097.998.046.875   2951100   AMZN
13  18/06/2020     265.397.998.046.875   2487800   AMZN
14  19/06/2020   2.675.010.009.765.620   5777000   AMZN
15  22/06/2020   2.713.820.068.359.370   3208800   AMZN
16  23/06/2020   2.764.409.912.109.370   4231700   AMZN
17  24/06/2020     273.439.990.234.375   4526600   AMZN
18  25/06/2020       2.754.580.078.125   2968700   AMZN
19  26/06/2020      26.928.701.171.875   6500800   AMZN
20  29/06/2020      26.803.798.828.125   4223400   AMZN
21  30/06/2020   2.758.820.068.359.370   3769700   AMZN
22  02/04/2023                   3500.0  1258100   AMZN

In [ ]:
amzn.reset_index(drop=True, inplace=True)
googl.reset_index(drop=True, inplace=True)

amzn.compare(googl)

In [103]:
df_diff = amzn.merge(googl, indicator=True, how='outer', on='Volume')
df_diff

,Date_x,Close _x,Volume,Symbol_x,Date_y,Close _y,Symbol_y,_merge
0,01/06/2020,24.710.400.390.625,2928900,AMZN,NaN,NaN,NaN,left_only
1,02/06/2020,2.472.409.912.109.370,2529900,AMZN,NaN,NaN,NaN,left_only
2,03/06/2020,247.839.990.234.375,2671000,AMZN,NaN,NaN,NaN,left_only
3,04/06/2020,246.060.009.765.625,2948700,AMZN,NaN,NaN,NaN,left_only
4,05/06/2020,2483.0,3306400,AMZN,NaN,NaN,NaN,left_only
5,08/06/2020,252.406.005.859.375,3970700,AMZN,NaN,NaN,NaN,left_only
6,09/06/2020,2.600.860.107.421.870,5176000,AMZN,NaN,NaN,NaN,left_only
7,10/06/2020,2.647.449.951.171.870,4946000,AMZN,NaN,NaN,NaN,left_only
8,11/06/2020,25.579.599.609.375,5800100,AMZN,NaN,NaN,NaN,left_only
9,12/06/2020,254.502.001.953.125,5429600,AMZN,NaN,NaN,NaN,left_only
10,15/06/2020,2.572.679.931.640.620,3865100,AMZN,NaN,NaN,NaN,left_only
11,16/06/2020,261.527.001.953.125,3585600,AMZN,NaN,NaN,NaN,left_only
12,17/06/2020,264.097.998.046.875,2951100,AMZN,NaN,NaN,NaN,left_only
13,18/06/2020,265.397.998.046.875,2487800,AMZN,NaN,NaN,NaN,left_only
14,19/06/2020,2.675.010.009.765.620,5777000,AMZN,NaN,NaN,NaN,left_only
15,22/06/2020,2.713.820.068.359.370,3208800,AMZN,NaN,NaN,NaN,left_only
16,23/06/2020,2.764.409.912.109.370,4231700,AMZN,NaN,NaN,NaN,left_only
17,24/06/2020,273.439.990.234.375,4526600,AMZN,NaN,NaN,NaN,left_only
18,25/06/2020,2.754.580.078.125,2968700,AMZN,NaN,NaN,NaN,left_only
19,26/06/2020,26.928.701.171.875,6500800,AMZN,NaN,NaN,NaN,left_only
20,29/06/2020,26.803.798.828.125,4223400,AMZN,NaN,NaN,NaN,left_only
21,30/06/2020,2.758.820.068.359.370,3769700,AMZN,NaN,NaN,NaN,left_only
22,02/04/2023,3500.0,1258100,AMZN,01/06/2020,14.348.699.951.171.800,GOOGL,both
23,NaN,NaN,1172100,NaN,02/06/2020,144.231.005.859.375,GOOGL,right_only
24,NaN,NaN,1386600,NaN,03/06/2020,1439.25,GOOGL,right_only
25,NaN,NaN,1349100,NaN,04/06/2020,1.414.300.048.828.120,GOOGL,right_only
26,NaN,NaN,2132100,NaN,05/06/2020,144.002.001.953.125,GOOGL,right_only
27,NaN,NaN,1693900,NaN,08/06/2020,14.480.400.390.625,GOOGL,right_only
28,NaN,NaN,1681200,NaN,09/06/2020,14.520.799.560.546.800,GOOGL,right_only
29,NaN,NaN,1588100,NaN,10/06/2020,1.464.699.951.171.870,GOOGL,right_only
30,NaN,NaN,2357200,NaN,11/06/2020,14.019.000.244.140.600,GOOGL,right_only
31,NaN,NaN,1832900,NaN,12/06/2020,14.129.200.439.453.100,GOOGL,right_only
32,NaN,NaN,1523400,NaN,15/06/2020,1.420.739.990.234.370,GOOGL,right_only
33,NaN,NaN,1532400,NaN,16/06/2020,1.446.469.970.703.120,GOOGL,right_only
34,NaN,NaN,1528300,NaN,17/06/2020,14.525.400.390.625,GOOGL,right_only
35,NaN,NaN,1743100,NaN,18/06/2020,14.341.199.951.171.800,GOOGL,right_only
36,NaN,NaN,2639200,NaN,19/06/2020,14.246.400.146.484.300,GOOGL,right_only
37,NaN,NaN,1472100,NaN,22/06/2020,14.506.600.341.796.800,GOOGL,right_only
38,NaN,NaN,1887600,NaN,23/06/2020,146.397.998.046.875,GOOGL,right_only
39,NaN,NaN,1579600,NaN,24/06/2020,1.432.699.951.171.870,GOOGL,right_only
40,NaN,NaN,1197900,NaN,25/06/2020,14.410.999.755.859.300,GOOGL,right_only
41,NaN,NaN,4882000,NaN,26/06/2020,13.625.400.390.625,GOOGL,right_only
42,NaN,NaN,2253700,NaN,29/06/2020,13.971.700.439.453.100,GOOGL,right_only
43,NaN,NaN,2014300,NaN,30/06/2020,1.418.050.048.828.120,GOOGL,right_only

In [68]:
df_diff = df_diff.loc[lambda x : x['_merge'] == 'both']

In [69]:
df_diff

,Date_x,Close _x,Volume,Symbol_x,Date_y,Close _y,Symbol_y,_merge
22,02/04/2023,3500.0,1258100,AMZN,01/06/2020,14.348.699.951.171.800,GOOGL,both

In [105]:
df_eq = amzn.equals(googl)
df_eq

False

In [97]:
df_difbol = amzn['Volume'].reset_index(drop=True, inplace=True) == googl['Volume'].reset_index(drop=True, inplace=True)
df_difbol

True

In [5]:
#Exemplo de renomear as colunas pelo index (posicao) delas no dataframe
amzn_noidx.rename(columns={amzn_noidx.columns[0]: 'Data_Full', amzn_noidx.columns[1]: 'Fechamento'}, inplace=True)
amzn_noidx.head()

   Data_Full  Fechamento                   Close    Volume Symbol
0          0  01/06/2020      24.710.400.390.625   2928900   AMZN
1          1  02/06/2020   2.472.409.912.109.370   2529900   AMZN
2          2  03/06/2020     247.839.990.234.375   2671000   AMZN
3          3  04/06/2020     246.060.009.765.625   2948700   AMZN
4          4  05/06/2020                  2483.0   3306400   AMZN

In [48]:
amzn.head(1)

                    AMZN_ Close   AMZN_Volume
Date
01/06/2020   24.710.400.390.625       2928900

In [7]:
msft.head(1)

         Date                   Close     Volume Symbol
0  01/06/2020   1.828.300.018.310.540   22622400   MSFT

In [8]:
googl.head(1)

         Date                    Close    Volume Symbol
0  01/06/2020   14.348.699.951.171.800   1258100  GOOGL

-Verificar as info gerais do DataFrame, verificando que ambos tem as mesmas estruturas e conjuntos de registros

In [9]:
googl.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 22 entries, 0 to 21
Data columns (total 4 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Date     22 non-null     object
 1    Close   22 non-null     object
 2   Volume   22 non-null     int64
 3   Symbol   22 non-null     object
dtypes: int64(1), object(3)
memory usage: 880.0+ bytes

# Concatenation of Tidy Data Source

In [10]:
all_df = pd.DataFrame()
all_df = all_df.append([amzn, googl, msft])

C:\Users\jrjos\AppData\Local\Temp\ipykernel_33088\1678780523.py:2: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  all_df = all_df.append([amzn, googl, msft])

In [11]:
all_df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 66 entries, 0 to 21
Data columns (total 4 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Date     66 non-null     object
 1    Close   66 non-null     object
 2   Volume   66 non-null     int64
 3   Symbol   66 non-null     object
dtypes: int64(1), object(3)
memory usage: 2.6+ KB

In [12]:
all_df.reset_index(drop=True, inplace=True)

In [13]:
all_df.shape

(66, 4)

In [14]:
all_df.head(3)

         Date                   Close    Volume Symbol
0  01/06/2020      24.710.400.390.625   2928900   AMZN
1  02/06/2020   2.472.409.912.109.370   2529900   AMZN
2  03/06/2020     247.839.990.234.375   2671000   AMZN

# Concatenation of tidy data source - pd.concat()

In [15]:
#concat e append são a mesma funcionalidade -->> adicionar linhas ao final do df, porem o concat eh mais performatico e recente

all_concat = pd.concat([amzn, googl, msft])
all_concat.reset_index(drop=True, inplace=True)
all_concat.shape

(66, 4)

In [16]:
all_concat.head(3)

         Date                   Close    Volume Symbol
0  01/06/2020      24.710.400.390.625   2928900   AMZN
1  02/06/2020   2.472.409.912.109.370   2529900   AMZN
2  03/06/2020     247.839.990.234.375   2671000   AMZN

# Multi-Level indexing

In [17]:
all_concat.set_index(['Symbol', 'Date'], inplace=True)
all_concat.head(3)

                                    Close    Volume
Symbol Date
AMZN   01/06/2020      24.710.400.390.625   2928900
       02/06/2020   2.472.409.912.109.370   2529900
       03/06/2020     247.839.990.234.375   2671000

In [18]:
all_concat.sort_index(inplace=True)
all_concat.head()

                                    Close    Volume
Symbol Date
AMZN   01/06/2020      24.710.400.390.625   2928900
       02/06/2020   2.472.409.912.109.370   2529900
       03/06/2020     247.839.990.234.375   2671000
       04/06/2020     246.060.009.765.625   2948700
       05/06/2020                  2483.0   3306400

In [21]:
#Por usar multi index infere que os campos ficam acessiveis como tuples, aonde tem que passar pelo loc, qual a chave e as demais colunas
#todas as colunas caracterizada pelo ':' para a tupla AMZN em 02/06/2020
all_concat.loc[('AMZN', '05/06/2020'), :]

 Close      2483.0
Volume      3306400
Name: (AMZN, 05/06/2020), dtype: object

In [22]:
#Somente a coluna Volume
all_concat.loc[('AMZN', '01/06/2020'), 'Volume']

2928900

In [23]:
#TUDO das tuplas somente para Volume
all_concat.loc[:, 'Volume']

Symbol  Date
AMZN    01/06/2020     2928900
        02/06/2020     2529900
        03/06/2020     2671000
        04/06/2020     2948700
        05/06/2020     3306400
                        ...
MSFT    24/06/2020    36740600
        25/06/2020    27803900
        26/06/2020    54675800
        29/06/2020    26701600
        30/06/2020    34310300
Name: Volume, Length: 66, dtype: int64

In [24]:
all_concat.index.levels

FrozenList([['AMZN', 'GOOGL', 'MSFT'], ['01/06/2020', '02/06/2020', '03/06/2020', '04/06/2020', '05/06/2020', '08/06/2020', '09/06/2020', '10/06/2020', '11/06/2020', '12/06/2020', '15/06/2020', '16/06/2020', '17/06/2020', '18/06/2020', '19/06/2020', '22/06/2020', '23/06/2020', '24/06/2020', '25/06/2020', '26/06/2020', '29/06/2020', '30/06/2020']])

In [25]:
all_concat.index.levels[0]

Index(['AMZN', 'GOOGL', 'MSFT'], dtype='object', name='Symbol')

In [26]:
all_concat.index.levels[1]

Index(['01/06/2020', '02/06/2020', '03/06/2020', '04/06/2020', '05/06/2020',
       '08/06/2020', '09/06/2020', '10/06/2020', '11/06/2020', '12/06/2020',
       '15/06/2020', '16/06/2020', '17/06/2020', '18/06/2020', '19/06/2020',
       '22/06/2020', '23/06/2020', '24/06/2020', '25/06/2020', '26/06/2020',
       '29/06/2020', '30/06/2020'],
      dtype='object', name='Date')

In [27]:
#Possivel passar lista interna para o Index como abaixo, e retornar os valores dentro dessa lista
all_concat.loc[(['AMZN', 'GOOGL'], '02/06/2020'), :]

                                    Close    Volume
Symbol Date
AMZN   02/06/2020   2.472.409.912.109.370   2529900
GOOGL  02/06/2020     144.231.005.859.375   1172100

In [28]:
#Comando slice -->> Pesquisar mais nunca usei
all_concat.loc[(slice(None), '02/06/2020'), :]

                                     Close     Volume
Symbol Date
AMZN   02/06/2020    2.472.409.912.109.370    2529900
GOOGL  02/06/2020      144.231.005.859.375    1172100
MSFT   02/06/2020   18.491.000.366.210.900   30794600

In [30]:
all_concat.loc[(slice('AMZN','GOOGL',1), '02/06/2020'), :]

                                    Close    Volume
Symbol Date
AMZN   02/06/2020   2.472.409.912.109.370   2529900
GOOGL  02/06/2020     144.231.005.859.375   1172100

In [31]:
all_concat.head()

                                    Close    Volume
Symbol Date
AMZN   01/06/2020      24.710.400.390.625   2928900
       02/06/2020   2.472.409.912.109.370   2529900
       03/06/2020     247.839.990.234.375   2671000
       04/06/2020     246.060.009.765.625   2948700
       05/06/2020                  2483.0   3306400

# Merging and concatenating tidy data

In [32]:
# duplica todas as colunas
all_concat_columns = pd.concat([amzn, googl, msft], axis=1)

In [33]:
all_concat_columns.head()

,Date,Close,Volume,Symbol,Date,Close,Volume,Symbol,Date,Close,Volume,Symbol
0,01/06/2020,24.710.400.390.625,2928900,AMZN,01/06/2020,14.348.699.951.171.800,1258100,GOOGL,01/06/2020,1.828.300.018.310.540,22622400,MSFT
1,02/06/2020,2.472.409.912.109.370,2529900,AMZN,02/06/2020,144.231.005.859.375,1172100,GOOGL,02/06/2020,18.491.000.366.210.900,30794600,MSFT
2,03/06/2020,247.839.990.234.375,2671000,AMZN,03/06/2020,1439.25,1386600,GOOGL,03/06/2020,18.536.000.061.035.100,27311000,MSFT
3,04/06/2020,246.060.009.765.625,2948700,AMZN,04/06/2020,1.414.300.048.828.120,1349100,GOOGL,04/06/2020,1.829.199.981.689.450,28761800,MSFT
4,05/06/2020,2483.0,3306400,AMZN,05/06/2020,144.002.001.953.125,2132100,GOOGL,05/06/2020,1.871.999.969.482.420,39893600,MSFT

In [ ]:
'''
DataFrame acima concatenado pelas colunas é poluído com informações duplicadas, e colunas não identificaveis como por exemplo Close e Volume, não tem relacao direta com o index externo
Podendo levar a erros fatais de integridade de dados, utilizando o parametro verify_integrity, garante essa verificacao
Se for pra fazer o append por linhas, usar o pandas.concat(), se for por colunas, usar o pandas.merge() existem diferenças cruciais sobre a estrutura e principalmente argumentos
concat() é mais performatico que o append() ambos tem a mesma função que é realizar o merge por linhas


#Lanca um erro
pd.concat([amzn, googl, msft], axis=1, verify_integrity=True)
'''

In [35]:
'''
Essa funcao pega o primeiro valor da coluna Symbol, e remove todos as duplicatas, nesse caso todos os valores
ja que o dataframe passado tem o nome da empresa como symbol, entao é removido também a coluna symbol,
em seguida define a data como index e renomeia as colunas atraves da atribuicao de lista 
por concatenar o valor de symbol com o nome atual do valor da coluna do dataframe passado
'''

def new_agg_df(df):

    my_list = []
    symbol = df['Symbol'].drop_duplicates().values[0]
    df.drop(['Symbol'], axis=1, inplace=True)
    df.set_index('Date', inplace=True)
    my_list = [symbol+'_'+elem for elem in df.columns]
    df.columns = my_list
    return df

In [36]:
#Chama a funcao passando o dataframe original
amzn_agg = new_agg_df(amzn)
msft_agg = new_agg_df(msft)
googl_agg = new_agg_df(googl)

In [37]:
#Temos o dataframe com a identificao de cada coluna individual atrelada ao dataframe original
googl_agg.head(1)

                       GOOGL_ Close   GOOGL_Volume
Date
01/06/2020   14.348.699.951.171.800        1258100

In [41]:
amzn.head()

                       AMZN_ Close   AMZN_Volume
Date
01/06/2020      24.710.400.390.625       2928900
02/06/2020   2.472.409.912.109.370       2529900
03/06/2020     247.839.990.234.375       2671000
04/06/2020     246.060.009.765.625       2948700
05/06/2020                  2483.0       3306400

In [42]:
msft.head()

                        MSFT_ Close   MSFT_Volume
Date
01/06/2020    1.828.300.018.310.540      22622400
02/06/2020   18.491.000.366.210.900      30794600
03/06/2020   18.536.000.061.035.100      27311000
04/06/2020    1.829.199.981.689.450      28761800
05/06/2020    1.871.999.969.482.420      39893600

In [38]:
#Resetando o index dos dataframes, através do argumento on, especifica-se qual sera o novo index que é compartilhado por ambos os dataframes
#how é a clausula join pesquisar se sao os mesmos do SQL (inner, left, right, ...)
#é possível também especificar diferentes index para cada dataframe right_on, left_on
#quando nao se reseta o index, podemos estipular qual index vai se manter atraves somente do argumento left=True, right=True
amzn_agg.reset_index().merge(msft_agg.reset_index(), how='inner', on='Date').head()

,Date,AMZN_ Close,AMZN_Volume,MSFT_ Close,MSFT_Volume
0,01/06/2020,24.710.400.390.625,2928900,1.828.300.018.310.540,22622400
1,02/06/2020,2.472.409.912.109.370,2529900,18.491.000.366.210.900,30794600
2,03/06/2020,247.839.990.234.375,2671000,18.536.000.061.035.100,27311000
3,04/06/2020,246.060.009.765.625,2948700,1.829.199.981.689.450,28761800
4,05/06/2020,2483.0,3306400,1.871.999.969.482.420,39893600

In [ ]:
all_merge_df = amzn_agg.merge(msft_agg, left_index=True, right_index=True).merge(googl_agg, left_index=True, right_index=True)

all_merge_df.head()

# Transformation of a dataset

In [ ]:
#Todos os dataframes concatenados por linhas, sem index
all_df.head()

## The pivot method

In [ ]:
'''
O index é a coluna que sera o index do dataframe pivot, a coluna, significa a coluna do dataframe no qual o pivot sera executado e mostrar os valores
e values, e qual a coluna do df original, que devera ser mostrado como valores da coluna estipulada no columns para o pivot
'''
pivot_close = all_df.pivot(index='Date', columns='Symbol', values='Close').sort_index()

In [ ]:
pivot_close.head()

In [ ]:
pivot_close_volume = all_df.pivot(index='Date', columns='Symbol').sort_index()

In [ ]:
pivot_close_volume.head()

In [ ]:
#Pesquisar diferença entre unstack e pivot -> Segundo aula quando tiver multi-index dataframe é melhor utilizar o unstack
another_df = all_df.set_index(['Symbol', 'Date'])
unstacked_df = another_df.unstack(level='Symbol')
unstacked_df.head()

In [ ]:
unstacked_df.stack(level='Symbol').head()

In [ ]:
stack_df = unstacked_df.stack(level='Symbol')
swapped_df = stack_df.swaplevel('Symbol', 'Date')
swapped_df.head()

In [ ]:
swapped_df.sort_index().head()

# Melting with Pandas

In [ ]:
all_df.shape

In [ ]:
#Pesquisar melhor o Melt
all_df.melt(id_vars=['Symbol', 'Date'])

## Aggregating results with Pandas

In [ ]:
all_df.head(1)

In [ ]:
# ValueError: Unable to parse string "24.710.400.390.625" at position 0
all_df['Close'] = pd.to_numeric(all_df['Close'])

In [ ]:
pivot_close = all_df.pivot(
    index='Symbol', 
    columns='Date', 
    values='Volume'
).sort_index().reset_index()

mean_pivot = pd.DataFrame()
mean_pivot['Symbol'] = pivot_close['Symbol'].to_list()

In [ ]:
#Por alguma razão esta dando erro de conversão, tentei separadamente aplicar o dtypes antes no all_df mas deu erro mesmo assim, pesquisar depois o erro

#Erro esta na formatacao do numero em Close, pois ao substituir por Volume funcionou

mean_pivot['average_price'] = pivot_close.set_index('Symbol').apply(
    lambda x: x.mean(), axis=1
).to_list()

In [ ]:
mean_pivot.set_index('Symbol')

In [ ]:
mean_pivot.head()

In [ ]:
#Por alguma razao os valores na coluna Close nos arquivos FF estao dando problema, pois ao trocar para volume funcionou
all_df.pivot_table(
    values='Volume',
    index='Symbol',
    aggfunc='mean',
)

In [ ]:
all_df.pivot_table(
    index='Symbol',
    aggfunc=['mean','median','max','min','std'],
)

## Group by

In [ ]:
#a coluna close nao funciona para as funcoes que tratam numeros, por isso erro no mean e median
grouped_stocks = all_df.groupby('Symbol')['Close'].max()
grouped_stocks

#Saida e um Series, usar o to_frame para transformar em um dataframe

In [ ]:
grouped_stocks.to_frame()

In [ ]:
all_df.groupby('Symbol')['Close'].agg(['max', 'min',])

In [ ]:
#possivel tambem utilizar funcoes de agregacao por cada coluna por um tipo diferente de agregacao
all_df.groupby('Symbol').agg({'Close' : ['max', 'min',], 'Volume' : ['median', 'max']})

# Plotting results with Pandas

In [ ]:
import matplotlib.pyplot as plt